# 1 ###########################################################################
print("1.	За допомогою нескінченного циклу згенеруйте ряд чисел Фібоначчі. Ряд починається з чисел 1, 1, 2, 3, 5, 8, 13,")
print("а кожен наступний елемент - це сума двох попередніх.")
print("Варіант з нескінченним циклом. Для прикладу - 12 перших елементів.")

#Варіант з нескінченним циклом
el1 = 1
el2 = 1
print(f"Значення 1 елемента  - {el1}")
print(f"Значення 2 елемента  - {el2}")
i = 0
#while True:   Варіант з нескінченним циклом
while i < 10:
    sum_el = el1 + el2
    el1 = el2
    el2 = sum_el
    i += 1
    print(f"Значення {i+2} елемента  - {el2}")


print("="*50)
print("Варіант з визначенням певного елемента")

#Варіант з визначенням певного елемента
el1 = 1
el2 = 1
n = input("Введіть номер елемента ряда Фібоначі: ")
n = int(n)
i = 0
while i < n - 2:
    sum_el = el1 + el2
    el1 = el2
    el2 = sum_el
    i += 1
if n == 1:
    print(f"Значення 1 елемента  - {el1}")
else:
    print(f"Значення {i+2} елемента  - {el2}")


print("="*50)

# 2 ###########################################################################

print("2. Створіть список, що містить числа від 0 до 100 та за допомогою List Comprehension отримайте")
print("з нього список чисел, що кратні 3.")

my_list = []
for i in range(1, 101):
    my_list.append(i)
print(my_list)
my_list_new = [v for v in my_list if v%3 == 0]
print(my_list_new)

print("="*50)

# 3 ###########################################################################

print("3.Напишіть цикл for, який просить ввести ціле число 10 разів, а потім роздруковує у консолі суму всіх введених чисел.")

sum = 0
for i in range(1, 11):
    n = input(f"Введіть {i} ціле число: ")
    sum = sum + int(n)
print(f"Сума введених чисел дорівнює: {sum}")

print("="*50)

# 4 ###########################################################################

print("4.Напишіть нескінченний цикл, який просить ввести ціле число і переривається, якщо введене число менше 0.")

num = input("Введіть будь-яке ціле число: ")
while True:
    if int(num) >= 0:
        num = input("Введіть будь-яке ціле число: ")
    else:
        print("Break")
        break

print("="*50)

# 5 ###########################################################################

print("5. Напишіть код. який просить ввести дві будь-яких змінних, а потім міняє їх місцями.")

n1 = input("Введіть перше значення: ")
n2 = input("Введіть друге значення: ")
print(n1, n2)
n1, n2 = n2, n1
print(n1, n2)
