# 1.	Напишіть функцію, яка отримує словник та назву у рядку, а потім створює файл з цією назвою,
# який містить всі дані з цього словника. Один рядок — одна пара ключ:значення.
print("1.	Напишіть функцію, яка отримує словник та назву у рядку, а потім створює файл з цією назвою,")
print("який містить всі дані з цього словника. Один рядок — одна пара ключ:значення." + "\n")

def file_dict(dict, fn):
    with open(fn, "w", encoding="utf8") as f:
        for i in dict.keys():
            el = str(i) + ": " + str(dict.get(i))
            f.write(el + "\n")

dict = {1: "One", 2: "Two", "abc": False}
fn = "HW_05.txt"
file_dict(dict, fn)


print("="*100)
# 2.	Створіть функцію, яка приймає рядок з назвою файлу, створеного функцією з попереднього завдання.
# Функція має зчитувати файл, записувати кожну пару ключ:значення у словник та повертати цей словник.
print("2.	Створіть функцію, яка приймає рядок з назвою файлу, створеного функцією з попереднього завдання.")
print("Функція має зчитувати файл, записувати кожну пару ключ:значення у словник та повертати цей словник." + "\n")

def get_dict(fn):
    with open(fn, "r") as f:
        row_s = []
        row_str = f.read()
        row_s = row_str.split("\n")
        row_dict = {}
        for i in row_s:
            if i != '':
                el = i.split(";")
                row_dict.update({el[0]: el[1]})
    return row_dict

print(get_dict("HW_05.txt"))


print("="*100)
# 3.	Напишіть функцію, яка роздруковує всі файли та каталоги поточного каталогу, а також їх кількість окремо.
# Назви каталогів повинні мати позначення "|"
print("3.	Напишіть функцію, яка роздруковує всі файли та каталоги поточного каталогу, а також їх кількість окремо.")
print("Назви каталогів повинні мати позначення |" + "\n")

import os

def get_list_dir():
    list = os.listdir()
    total = 0
    for i in list:
        print("| " + i)
        total += 1
    print(f"В поточному каталозі - {total} файлів та каталогів")

get_list_dir()
