print("="*100)
# 1. Порахуйте та роздрукуйте у консолі довжину кола. г=4. Формула: С = 2пг.
print("1. Порахуйте та роздрукуйте у консолі довжину кола. г=4. Формула: С = 2пг.")
import math

r = 4
c = 2 * r * math.pi
print("Довжина кола =", c)
print("="*100)
# Підказка: Ви можете знайти значення п у бібліотеці math.

# 2. Роздрукуйте у консолі довжину рядка "Му name is Python”.
print("2. Роздрукуйте у консолі довжину рядка Му name is Python")
my_str = "Му name is Python"
print("Довжина рядка ", len(my_str), "символів")
print("="*100)

# 3. Розрахуйте середнє значення чисел зі списку numbers = [1,8,5,4,12].
print("3. Розрахуйте середнє значення чисел зі списку numbers = [1,8,5,4,12]")
numbers = [1,8,5,4,12]
c = sum(numbers)
b = len(numbers)
print(f"Cереднє значення чисел зі списку {numbers} це", c/b)
print("="*100)

# 4. Створіть словник, в якому ключами будуть назви ваших улюблених фільмів, а значеннями - оцінки цих фільмів на IMDB.
print("4. Створіть словник, в якому ключами будуть назви ваших улюблених фільмів, а значеннями - оцінки цих фільмів на IMDB.")
my_dict = {"Термінатор 1": 9.1, "Термінатор 2": 9.3, "Мумія": 8.9}
print(my_dict)
print("="*100)

# 5. Створіть список з трьома будь-якими елементами. Роздрукуйте у консолі перший елемент.
print("5. Створіть список з трьома будь-якими елементами. Роздрукуйте у консолі перший елемент.")
my_list = [111, 5, "Hi", True]
print(my_list)
print(my_list[0])
print("="*100)

# 6. Створіть рядок, який містить слово "python". Роздрукуйте у консолі цей рядок великими буквами.
print("6. Створіть рядок, який містить слово python. Роздрукуйте у консолі цей рядок великими буквами.")
my_str1 = "I like Python"
print(my_str1)
print(my_str1.upper())
print("="*100)

# 7. За допомогою Python розрахуйте кількість бітів у кілобайті.
print("7. За допомогою Python розрахуйте кількість бітів у кілобайті.")
print("Кількість бітів у кілобайті = ", 1024*8)
print("="*100)

# 8. Роздрукуйте у консолі рядок "Р Y Т Н О N" без пробілів.
print("8. Роздрукуйте у консолі рядок Р Y Т Н О N без пробілів.")
my_str3 = "Р Y Т Н О N"
print(my_str3.replace(" ", ""))
print("="*100)

#####################################################################################################
# Задачі

# ● Напишіть програму, яка просить ввести рядок, потім просить ввести
# символ та рахує, скільки разів цей символ зустрічається у рядку
print("Напишіть програму, яка просить ввести рядок, потім просить ввести")
print("символ та рахує, скільки разів цей символ зустрічається у рядку")
a = input("Введіть рядок: ")
b = input("Введіть симол для пошуку: ")
print(f"Символ {b} вперше знаходиться на {a.find(b)} місці і зустрічається {a.count(b)} разів")
print("="*100)

# ● Напишіть програму, яка приводить рядок до множини з буквами з цього рядку
print("Напишіть програму, яка приводить рядок до множини з буквами з цього рядку")
a1 = input("Введіть рядок: ")
print(f"Множина з буквами з цього рядку {list(a1)}")
print("="*100)

# ● Напишіть програму, яка переводить гігабайти в кілобайти
print("Напишіть програму, яка переводить гігабайти в кілобайти")
a2 = input("Введіть кількість гігабайтів: ")
print(f"В {a2} гігабайтах {int(a2)*1024*1024} кілобайтів")
print("="*100)

# ● Напишіть програму, яка конвертує роки віку у кількість місяців. У якості
# вхідних параметрів программа повинна приймати кількість повних
# прожитих років і кількість місяців, що минули з останнього дня народження.
print("Напишіть програму, яка конвертує роки віку у кількість місяців. У якості")
print("вхідних параметрів программа повинна приймати кількість повних")
print("прожитих років і кількість місяців, що минули з останнього дня народження.")
ag1 = input("Введіть кількість повних років: ")
ag2 = input("Введіть кількість повних місяців: ")
print(f"В {ag1} роках і {ag2} місяцях  - {int(ag1)*12 + int(ag2)} місяці")
print("="*100)

# ● За одну секунду у світі народжується 1 дитина. Створити програму, яка
# порахує кількість народжених дітей за 13 днів, 17 годин, 35 хвилин та 12 секунд.
print("За одну секунду у світі народжується 1 дитина. Створити програму, яка")
print("порахує кількість народжених дітей за 13 днів, 17 годин, 35 хвилин та 12 секунд.")
print(f"Кількість народжених дітей за 13 днів, 17 годин, 35 хвилин та 12 секунд = {12 + 35*60 + 17*60*60 + 13*24*60*60}")
print("="*100)
