# 1. Написати програму «Вгадай число».
# Комп'ютер генерує число від 1 до 100 і надає користувачеві 6 спроб,
# щоб він міг вгадати число. Коли користувач вводить число у консолі, комп'ютер перевіряє,
# чи відповідає воно заданому. Якщо число не вірне, то користувач отримує повідомлення про те,
# менше чи більше число від заданого. Якщо користувач вгадав число,
# то йому повідомляється про перемогу і про кількість використаних ним спроб.
# У разі вичерпання всіх спроб, користувач отримує повідомлення про програш.
# Перед написанням програми, опишіть її алгоритм використовуючи псевдокод.
# Після реалізації коду, залиште псевдокод, як коментарі до нього.
print("="*100)
print("Задача №1: «Вгадай число»" + "\n")

import random
def guess_number():
    guess_num = random.randint(1, 100)
    min_num = 1
    max_num = 100
    for i in range(1, 7):
        print("="*100)
        print(f"Спроба №: {i}")
        at_num = int(input(f"Введіть число від {min_num} до {max_num}: "))
        if at_num == guess_num:
            print("=" * 100)
            print(f"Ви вгадали число {guess_num} і використали {i} спроб")
            break
        elif at_num > guess_num and i < 6:
            max_num = at_num - 1
            print(f"Менше. Загадане число від {min_num} до {max_num}")
        elif at_num < guess_num  and i < 6:
            min_num = at_num + 1
            print(f"Більше. Загадане число від {min_num} до {max_num}")
        elif at_num != guess_num and i == 6:
            print("=" * 100)
            print(f"Ви не вгадали! Було загадано число: {guess_num}")

guess_number()

# Псевдокод:
# 1) Визначаємо min_num = 1 та max_num = 100
# 2) Через автогенератор визначаємо guess_num = random.randint(1, 100)
# 3) В циклі перевіряємо виконання рівності/нерівності введеного числа заданому числу
# 3.1) Якщо at_num == guess_num - число вгадано, цикл переривається і виводиться відповідне повідомлення.
# 3.2) Якщо at_num > guess_num перепризначаємо максимальне значення
# 3.3) Якщо at_num < guess_num перепризначаємо мінімальне значення
# 3.4) Якщо всі спроби вичерпані і число не вгадано, то виводиться відповідне повідомлення



# 2. Написати програму з використанням рекурсії. Програма повинна приймати з консолі ціле натуральне число.
# Далі, використовуючи функцію, в якій реалізований механізм рекурсії,
# програма віднімає від заданого числа одиницю і виводити у консоль поточне число.
# Програма повинна припинити роботу, коли число дорівнюватиме нулю.
print("="*100)
print("="*100 + "\n")
print("Задача №2")

def number_rec(a):
    if a>=0:
        print(a)
        a -= 1
        number_rec(a)

a = int(input(f"Введіть ціле натуральне число: "))
number_rec(a)
